"use strict";

console.log('111') 
console.log('222') /* если не ставить ; и писать с новой строчки ошибки не будет */

/*если писать в одну строку без ; то будет ошибка*/
/* лучше всегда ставить ; так как при сжатии кода могут появиться ошибки */


console.log('111'); /* без ; во 2 выдает ошибку*/
['Учим', 'JS'].forEach(alert); /*вызывает алертом элементы массива*/
// Метод forEach() выполняет функцию callback один раз для каждого элемента, находящегося в массиве в порядке возрастания.

alert('я учу js');

